# GetCoordinates Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PolyLine..::..GetCoordinates Method
PolyLine Class See Also
---
Gets the coordinate points of the polyline.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public IList<XYZ> GetCoordinates()
```

Visual Basic
---
```text
Public Function GetCoordinates As IList(Of XYZ)
```

Visual C++
---
```text
public:
IList<XYZ^>^ GetCoordinates()
```

# See Also
PolyLine Class
Autodesk.Revit.DB Namespace